mbucab/app/controllers/addresses_controller.rb

SELECT * FROM "addresses" WHERE ("addresses"."id" = 980190962)
---
  def show
    @address = Address.find(params[:id])

SELECT * FROM "addresses" WHERE ("addresses"."id" = 980190962)
---
  def destroy
    @address = Address.find(params[:id])