mbucab/app/controllers/clients_controller.rb

  def show
    if(session[:id].to_s!=params[:id].to_s)
      redirect_to :controller => 'home', :action => 'index'
    else
      @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("created_at", "updated_at", "account", "middlename", "lastname", "firstname", "birthday", "phone", "surname", "active") VALUES('2011-06-12 19:45:32', '2011-06-12 19:45:32', 'usuario@prueba.com', 'ario', 'pru', 'usu', '2011-04-15', 1234567890, 'eba', 1)