mbucab/app/controllers/creditcards_controller.rb

SELECT * FROM "creditcards" WHERE ("creditcards"."id" = 980190962)
---
  def show
    creditcard = Creditcard.find(:first, :conditions => [" id = ?", params[:id] ])

SELECT * FROM "creditcards" WHERE ("creditcards"."id" = 980190962)
---
  def destroy
    @creditcard = Creditcard.find(params[:id])