mbucab/app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT * FROM "employees"

  def show
    @employee = Employee.find(params[:id])
---
SELECT * FROM "employees" WHERE ("employees"."id" = 980190962)

  def destroy
    @employee = Employee.find(params[:id])
---
SELECT * FROM "employees" WHERE ("employees"."id" = 980190962)