mbucab/app/controllers/orders_controller.rb

SELECT * FROM "orders" WHERE ("orders"."id" = 980190962)
---
  def destroy
    @order = Order.find(params[:id])