mbucab/app/controllers/packages_controller.rb

SELECT * FROM "packages" WHERE ("packages"."id" = 980190962)
---
  def show
    @package = Package.find(params[:id])

SELECT * FROM "packages" WHERE ("packages"."id" = 980190962)
---
  def destroy
    @package = Package.find(params[:id])