mbucab/app/controllers/routes_controller.rb

  def show
    @route = Route.find(params[:id])
---
SELECT * FROM "routes" WHERE ("routes"."id" = 980190962)

  def destroy
    @route = Route.find(params[:id])
---
SELECT * FROM "routes" WHERE ("routes"."id" = 980190962)