mbucab/app/controllers/web_service_controller.rb

  def support_request  # revisar si el cliente ya existe para no crearlo de nuevo y verificar los datos.

    @error = true
    if re = request_exception
      re_name = re.name.to_s
      if re_name == "REXML::ParseException"
        xml = nil
      else
        xml = params[:support_request]
      end
    end
    if xml != nil    ############### desde aqui
      @client = Client.find(:first, :conditions => [" account = ?", xml["client"] ])

      if @client and @client.active == 1 # si consigue al cliente(compania) y esta activo
        @address = Address.find(:first, :conditions => [" nickname = ?", xml["address"]])
        @creditcard = Creditcard.find(:first, :conditions => [" number = ?", xml["creditcard"]])

        if @address and @creditcard and @address.client_id == @client.id and @creditcard.client_id == @client.id# si se econtro la tarjeta y la direccion

          Order.transaction do # Order.transaction
            @order = Order.new(xml["order"])
            @order.client_id = @client.id
            @order.address_id = @address.id
            @order.creditcard_id = @creditcard.id
            @order.status = 0
            @order.latitude = 0
            @order.longitude = 0
            if @order.save
              @package = Package.new(xml["package"])
              @package.order_id = @order.id
              @package.price = @package.weight * 5
              if @package.save
---
SELECT * FROM "clients" WHERE ("clients"."id" = 1)
SELECT * FROM "addresses" WHERE ( nickname ='Mi Casa' AND client_id =980190963 AND id !=NULL) LIMIT 1
SELECT "creditcards".id FROM "creditcards" WHERE ("creditcards"."number" = 7777777777777777 AND "creditcards".id <> 980190963) LIMIT 1
INSERT INTO "addresses" ("name", "number", "city", "zip", "latitude", "created_at", "country", "zone", "nickname", "updated_at", "street", "client_id", "longitude") VALUES('edi prueba', '1', 'Caracas', 1023, 10.4493563318414, '2011-06-12 20:47:39', 'Venezuela', 'PRUEBAS', 'Mi Casa', '2011-06-12 20:47:39', 'calle prueba', 980190963, -66.8719526074219)
INSERT INTO "clients" ("created_at", "updated_at", "account", "middlename", "lastname", "firstname", "birthday", "phone", "surname", "active") VALUES('2011-06-12 20:34:04', '2011-06-12 20:34:04', 'usuario@prueba.com', 'ario', 'pru', 'usu', '2011-04-15', 1234567890, 'eba', 1)
INSERT INTO "creditcards" ("number", "name", "created_at", "code", "updated_at", "expdate", "client_id") VALUES(5555555555555555, 'Senor Prueba', '2011-06-12 20:52:36', 111, '2011-06-12 20:52:36', '2013-05-01', 980190963)
INSERT INTO "orders" ("name", "number", "city", "latitude", "created_at", "zip", "country", "collectiondate", "updated_at", "zone", "date", "recipient", "street", "deliverydate", "address_id", "client_id", "external", "company_id", "longitude", "status", "order_type", "extra", "creditcard_id", "route_id") VALUES('nombre', 1, 'ciudad', 1.5, '2011-06-12 20:55:52', 1111, 'pais', '2011-04-16 13:56:05', '2011-06-12 20:55:52', 'zona', '2011-04-16 13:56:05', 'destinatario prueba', 'calle', '2011-04-16 13:56:05', 980190963, 980190963, NULL, NULL, 1.5, 0, NULL, NULL, 980190963, NULL)
INSERT INTO "packages" ("price", "created_at", "order_id", "updated_at", "weight", "description") VALUES(7.5, '2011-06-12 22:18:37', 980190963, '2011-06-12 22:18:37', 1.5, 'MyString')
UPDATE "orders" SET "updated_at" = '2011-06-16 20:30:28', "recipient" = 'recipient nuevo' WHERE "id" = 980190963