trunk/mbucab/app/controllers/addresses_controller.rb

SELECT * FROM "addresses" WHERE ( client_id = 2)
---
  def index
    @addresses = Address.find(:all, :conditions => [" client_id = ?", session[:id] ])

SELECT * FROM "addresses" WHERE ("addresses"."id" = 4)
---
  def show
    adress = Address.find(:first, :conditions => [" id = ?", params[:id] ])

INSERT INTO "addresses" ("name", "number", "city", "zip", "latitude", "created_at", "country", "zone", "nickname", "updated_at", "street", "client_id", "longitude") VALUES('aaaa', 123, 'aaaa', 12, 29.10203001, '2011-04-24 05:01:31', 'aaaaa', 'aaaa', 'aaaa', '2011-04-24 05:01:31', 'aaaa', 2, 23.12132)
---
  def create
    @address = Address.new(params[:address])
    @address.client_id=session[:id]
    respond_to do |format|
      if @address.save