trunk/mbucab/app/controllers/clients_controller.rb

 def index
    @clients = Client.all
---
SELECT * FROM "clients" WHERE ( id = 6)

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 2)

  def new

       request.query_string.split(/&/).inject({}) do |hash, setting|
         key, val = setting.split(/=/)
         if key == 'openid.ext1.value.firstname'
          @nombre = val
         end
         if key == 'openid.ext1.value.lastname'
          @apellido = val
         end
         if key == 'openid.ext1.value.email'
          usuario, correo  = val.split(/%40/)
          @email = usuario + '@' + correo
         end
       end

    client= Client.find(:first, :conditions => [" account = ?", @email ])
---
SELECT * FROM "clients" WHERE ( account = NULL) LIMIT 1

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 6)

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("created_at", "updated_at", "account", "middlename", "lastname", "firstname", "birthday", "phone", "surname", "active") VALUES('2011-06-12 19:45:32', '2011-06-12 19:45:32', 'usuario@prueba.com', 'ario', 'pru', 'usu', '2011-04-15', 1234567890, 'eba', 1)