trunk/mbucab/app/controllers/creditcards_controller.rb

SELECT * FROM "creditcards" WHERE ( client_id = 2)
---
  def index
    @creditcards = Creditcard.find(:all, :conditions => [" client_id = ?", session[:id] ])

SELECT * FROM "creditcards" WHERE ("creditcards"."id" = 1)
---
  def show
    @creditcard = Creditcard.find(params[:id])

SELECT * FROM "creditcards" WHERE ("creditcards"."id" = 5)
---
  def edit
    @creditcard = Creditcard.find(params[:id])

INSERT INTO "creditcards" ("number", "name", "created_at", "code", "updated_at", "expdate", "client_id") VALUES(1234567891234567, 'pedro', '2011-05-06 19:34:58', 123, '2011-05-06 19:34:58', '2011-09-01', 2)
---
  def create
    @creditcard = Creditcard.new(params[:creditcard])
    @creditcard.client_id=session[:id]
    respond_to do |format|
      if @creditcard.save