trunk/mbucab/app/controllers/orders_controller.rb

SELECT * FROM "orders" WHERE ( client_id = 2)
---
  def index
    @orders = Order.find(:all, :conditions => [" client_id = ?", session[:id] ])

SELECT * FROM "orders" WHERE ("orders"."id" = 1)
SELECT * FROM "addresses" WHERE (id = 4) LIMIT 1
SELECT * FROM "creditcards" WHERE (id = 1) LIMIT 1
SELECT * FROM "clients" WHERE ( account = 'cotufa9@gmail.com' ) LIMIT 1
SELECT * FROM "packages" WHERE ("packages".order_id = 9)
---
  def show
    @order = Order.find(params[:id])
    @address    = Address.first(:conditions =>["id = ?", @order.address_id])
    @creditcard = Creditcard.first(:conditions =>["id = ?", @order.creditcard_id])
    client      = Client.first(:conditions => [" id = ? ", @order.client_id])
    @name       = client.firstname + " " + client.lastname
    #aqui se pone el ip y el metodo para hacer lo del codigo qr

    @qr = "http://chart.apis.google.com/chart?chs=220x220&cht=qr&chl=http://"+local_ip+"/orders/" + @order.id.to_s

     @total = 0
     @order.packages.each do |package|

SELECT * FROM "clients" WHERE ( account = 'cotufa9@gmail.com' ) LIMIT 1
SELECT * FROM "addresses" WHERE (client_id = 2)
---
  def new
    @order = Order.new
    session[:order_params] = nil
    session[:order_params] ||= {}
    session[:order_step]   = nil

    client = Client.first(:conditions => [" account = ? ", session[:user]])
    @addresses = Address.all(:conditions =>["client_id = ?", client.id])

SELECT * FROM "orders" WHERE ("orders"."id" = 15)
---
  def edit
    @order = Order.find(params[:id])

SELECT * FROM "clients" WHERE ( account = 'cotufa9@gmail.com' ) LIMIT 1
INSERT INTO "orders" ("latitude", "created_at", "collectiondate", "updated_at", "date", "recipient", "fulladdress", "deliverydate", "address_id", "client_id", "longitude", "status", "creditcard_id") VALUES(NULL, '2011-04-19 04:20:41', '2011-04-19 04:19:00', '2011-04-19 04:20:41', '2011-04-19 04:19:00', 'claudia', 'calle claudia', '2011-04-19 04:19:00', 2, 2, NULL, NULL, 1)
INSERT INTO "packages" ("price", "created_at", "order_id", "updated_at", "weight", "description") VALUES(0.0, '2011-04-22 01:52:08', 9, '2011-04-22 01:52:08', 3.0, 'kgiug')
---
  def create
    if session[:order_step] == "packages" and !params[:back_button]
     session[:order_params] = nil
     session[:order_params] ||= {}
    end
    session[:order_params].deep_merge!(params[:order]) if params[:order]
    @order = Order.new(session[:order_params])
    @order.current_step = session[:order_step]

     if @order.current_step == "confirmation" and !params[:back_button]
       @order.client_id = session[:id]
       @order.status    = 0
       @order.packages.each do |package|
               #poner aqui la regla para el precio y iva y cambiarlo a una funcion aparte para no sobrecargar aqui
               actual = package.weight * 5
               package.price = actual
       end
       @order.save

SELECT * FROM "addresses" WHERE (id = 3) LIMIT 1
---
       @total = 0
       if @order.current_step == "packages"
          client = Client.first(:conditions => [" account = ? ", session[:user]])
          @addresses = Address.all(:conditions =>["client_id = ?", client.id])

SELECT * FROM "creditcards" WHERE (client_id = 2 AND :valite != 'has passed')
---
               @total = @total + actual
               package.price = actual
             end
             @creditcards = Creditcard.all(:conditions =>["client_id = ? AND expdate > ?", session[:id], Date.current])

SELECT * FROM "orders" WHERE ("orders"."id" = 3)
DELETE FROM "orders" WHERE "id" = 3
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy