trunk/mbucab/app/controllers/session_controller.rb

SELECT * FROM "clients" WHERE ( account = 'cotufa9@gmail.com') LIMIT 1
---
  def client_login

    request.query_string.split(/&/).inject({}) do |hash, setting|
      key, val = setting.split(/=/)
      if key == 'openid.mode'
        @cancel = val
      end
      if key == 'openid.ext1.value.email'
        usuario, correo  = val.split(/%40/)
        @email = usuario + '@' + correo
      end
    end

    if @cancel=='cancel'
      redirect_to :controller => 'home', :action => 'index'
    else
      client= Client.find(:first, :conditions => [" account = ?", @email ])